NN_JD_FullCourse/src/Documents/PriceSetup/PriceSetup.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>PriceSetup</name>
  <registerRecords>InformationRegister.ProductPrices</registerRecords>
  <attributes>
    <name>LoadedFromFile</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Products</name>
    <attributes>
      <name>Product</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

NN_JD_FullCourse/src/InformationRegisters/ProductPrices/ProductPrices.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ProductPrices</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Price</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Product</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

NN_JD_FullCourse/src/Documents/PriceSetup/ObjectModule.bsl
Procedure Posting(Cancel, Mode)
	
	RegisterRecords.ProductPrices.Write = True;
	For Each CurRowProducts In Products Do
		Record = RegisterRecords.ProductPrices.Add();
		Record.Period 	= Date;
		Record.Product 	= CurRowProducts.Product;
		Record.Price 	= CurRowProducts.Price;
	EndDo;
	
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	
	If TypeOf(FillingData) = Type("Structure") Then
		
		If FillingData.Property("Products") Then
			
			FillProductAndServices(FillingData.Products);
			
		EndIf;
	
	EndIf;
	
EndProcedure

Procedure FillProductAndServices(ProductsToAdd)
	
	For Each Product In ProductsToAdd Do
	
		Products.Add().Product = Product;
	
	EndDo;
	
EndProcedure
